---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FbxLightSpotBeamAngle
source: html/bce4d178-3a59-666d-1655-09aa45db4173.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FbxLightSpotBeamAngle Property

"Spot Beam Angle"

## Syntax (C#)
```csharp
public static ForgeTypeId FbxLightSpotBeamAngle { get; }
```